readme.org
#+title:    Python Fundamentals
#+author:   Alberto Valdez
#+email:    avq5ac1@gmail.com
#+SETUPFILE: https://albertov5.github.io/org-html-themes/org/theme-readtheorg.setup
#+PROPERTY: header-args :mkdirp yes :dir . :exports both
#+PROPERTY: header-args:shell :results drawer :wrap example :results silent
#+PROPERTY: header-args:python :exports both :results output replace
#+INCLUDE: ./publish.inc


| [[https://albertov5.github.io/tec-data][<<<Home]] | [[./lesson-1.org][Lesson-1]] | [[./lesson-2.org][Lesson-2]] | [[./challenge/readme.org][Challenge>>>]] |

* Introduction

Python is one of the most popular languages in the world, used in many industries to accomplish different goals. It's very easy to use, as you can focus on the problem and not the intricacies of the language.

Here is a YouTube playlist of keynotes that I've collected over the past month while practicing and studying Python:

#+begin_export html
<iframe width="560" height="315" src="https://www.youtube.com/embed/videoseries?list=PLdswL3Tb01gznKrZf0_XeOc6ftUO3yZhn" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+end_export

-----------------------

**   Git

Version control tool that will allow us to interact with GitHub from the Terminal.

Installing homebrew

=/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"=

Installing git

=brew install git=

=brew install git-lfs=

Checking versions
#+NAME: git_version
#+begin_src shell
git --version
#+end_src
#+CALL: git_version()

#+NAME: git_lfs_version
#+begin_src shell
git-lfs --version
#+end_src
#+CALL: git_lfs_version()

* Python

#+NAME: pyenv_version_name
#+begin_src shell :exports none
pyenv version-name
#+end_src

We can check the version with:

#+NAME: python_version
#+begin_src shell
python --version
#+end_src
#+CALL: python_version()

We can run an interactive Python REPL from the terminal with:
#+NAME: python_repl
#+begin_src shell
python
#+end_src


** Python versions - End of life
[[https://endoflife.date/python][End of life]] is a website that shows the dates of when a Python version is not longer receiving security updates. For example:

| Version | Released    | End of life |
|---------+-------------+-------------|
|     3.7 | 26 Jun 2018 | 27 Jun 2023 |
|     2.7 | 03 Jul 2020 | 01 Jan 2020 |

The Python version is best chosen depending on the libraries you are planning on using, and most of the time the better supported versions are the ones released 2+ years ago.


* Working with Python files

** Creating a file from the Terminal

Let's list our working directory.

#+begin_src shell :results output replace
ls
#+end_src

#+RESULTS:
#+begin_example
LICENSE
challenge
index.html
lesson-1.html
lesson-1.md
lesson-1.org
lesson-2.html
lesson-2.md
lesson-2.org
publish.inc
readme.html
readme.md
readme.org
resources
#+end_example

We can create a new Python file in the resources directory.

#+begin_src shell
touch resources/hello_world.py
#+end_src

** Editing a file

Start working in the current directory.
#+begin_src shell
code .
#+end_src

We can use =Shift+P= in VS Code to open a file. Then find out =hello_world.py= file and input some Python code.

#+begin_src python :results silent
print("Hello Wold!")
#+end_src

In VSCode we can use =Shift-Cmd-P= and search for the =Python: Select Interpreter= command to make sure we are working with the Python version we want to work with.

** Running a file

#+begin_src shell :results output replace
python resources/hello_world.py
#+end_src

#+RESULTS:
#+begin_example
Hello World!
#+end_example

* Python Types

Determining the type of a variable or constant.

#+begin_src python
print(type(2019))
print(type(73.81))
print(type("hello"))
print(type(""))
print(type(None))
print(type(False))
#+end_src

#+RESULTS:
: <class 'int'>
: <class 'float'>
: <class 'str'>
: <class 'str'>
: <class 'NoneType'>
: <class 'bool'>

| Data Type           | Python Classification |
|---------------------+-----------------------|
| Integers            | <class 'int'>         |
| Float point numbers | <class 'float'>       |
| Strings             | <class 'str'>         |
| Boolean             | <class 'bool'>        |

