readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-18 Mon 22:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Fundamentals</title>
<meta name="author" content="Alberto Valdez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://albertov5.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://albertov5.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python Fundamentals</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org09e8a9d">1. Introduction</a>
<ul>
<li><a href="#orgf80bdc9">1.1. Git</a></li>
</ul>
</li>
<li><a href="#org620a0e8">2. Python</a>
<ul>
<li><a href="#orgc252684">2.1. Python versions - End of life</a></li>
</ul>
</li>
<li><a href="#orgd1ed66d">3. Working with Python files</a>
<ul>
<li><a href="#org289809a">3.1. Creating a file from the Terminal</a></li>
<li><a href="#org9e23548">3.2. Editing a file</a></li>
<li><a href="#org20ff3e0">3.3. Running a file</a></li>
</ul>
</li>
<li><a href="#org4d1f80b">4. Python Types</a>
<ul>
<li><a href="#org069aabf">4.1. Creating a variable</a></li>
<li><a href="#orge4b429c">4.2. Keywords</a></li>
<li><a href="#org275ff39">4.3. Python Operations</a></li>
</ul>
</li>
<li><a href="#orgf4586a1">5. Python Lists</a></li>
<li><a href="#orgcbe33a7">6. Python Tuples</a></li>
<li><a href="#orgce49552">7. Python Dictionaries</a></li>
<li><a href="#org4f79676">8. Decision Statements</a>
<ul>
<li><a href="#org18b718c">8.1. Nested if statements</a></li>
<li><a href="#orgb168873">8.2. Elif</a></li>
<li><a href="#orgf4503f3">8.3. Logical Operators</a></li>
</ul>
</li>
<li><a href="#org9181007">9. Loops</a>
<ul>
<li><a href="#org1fe2379">9.1. Iterating over Dictionaries</a></li>
</ul>
</li>
<li><a href="#org4bd0439">10. F-Strings and Printing</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://albertov5.github.io/tec-data">&lt;&lt;&lt;Home</a></td>
<td class="org-left"><a href="./lesson-1.html">Lesson-1</a></td>
<td class="org-left"><a href="./lesson-2.html">Lesson-2</a></td>
<td class="org-left"><a href="./challenge/readme.html">Challenge&gt;&gt;&gt;</a></td>
</tr>
</tbody>
</table>

<p>
<a href="https://github.com/albertov5/tec-data-03-python">Repository</a>
</p>


<div id="outline-container-org09e8a9d" class="outline-2">
<h2 id="org09e8a9d"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Python is one of the most popular languages in the world, used in many industries to accomplish different goals. It&rsquo;s very easy to use, as you can focus on the problem and not the intricacies of the language.
</p>

<p>
Here is a YouTube playlist of keynotes that I&rsquo;ve collected over the past month while practicing and studying Python:
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/videoseries?list=PLdswL3Tb01gznKrZf0_XeOc6ftUO3yZhn" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<hr />
</div>

<div id="outline-container-orgf80bdc9" class="outline-3">
<h3 id="orgf80bdc9"><span class="section-number-3">1.1.</span> Git</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Version control tool that will allow us to interact with GitHub from the Terminal.
</p>

<p>
Installing homebrew
</p>

<p>
<code>/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"</code>
</p>

<p>
Installing git
</p>

<p>
<code>brew install git</code>
</p>

<p>
<code>brew install git-lfs</code>
</p>

<p>
Checking versions
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org65a5929"><span style="color: #33CCAA;">git</span> --version
</pre>
</div>
<pre class="example" id="org4ba8789">
git version 2.24.3 (Apple Git-128)
</pre>

<div class="org-src-container">
<pre class="src src-shell" id="org36dd970">git-lfs --version
</pre>
</div>
<pre class="example" id="orgac20789">
git-lfs/3.2.0 (GitHub; darwin amd64; go 1.18.2)
</pre>
</div>
</div>
</div>

<div id="outline-container-org620a0e8" class="outline-2">
<h2 id="org620a0e8"><span class="section-number-2">2.</span> Python</h2>
<div class="outline-text-2" id="text-2">
<p>
We can check the version with:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org5c7f0c9">python --version
</pre>
</div>
<pre class="example" id="org35b7046">
Python 3.7.13
</pre>

<p>
We can run an interactive Python REPL from the terminal with:
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org87ed648">python
</pre>
</div>
</div>


<div id="outline-container-orgc252684" class="outline-3">
<h3 id="orgc252684"><span class="section-number-3">2.1.</span> Python versions - End of life</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://endoflife.date/python">End of life</a> is a website that shows the dates of when a Python version is not longer receiving security updates. For example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-left">Released</th>
<th scope="col" class="org-left">End of life</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3.7</td>
<td class="org-left">26 Jun 2018</td>
<td class="org-left">27 Jun 2023</td>
</tr>

<tr>
<td class="org-right">2.7</td>
<td class="org-left">03 Jul 2020</td>
<td class="org-left">01 Jan 2020</td>
</tr>
</tbody>
</table>

<p>
The Python version is best chosen depending on the libraries you are planning on using, and most of the time the better supported versions are the ones released 2+ years ago.
</p>
</div>
</div>
</div>


<div id="outline-container-orgd1ed66d" class="outline-2">
<h2 id="orgd1ed66d"><span class="section-number-2">3.</span> Working with Python files</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org289809a" class="outline-3">
<h3 id="org289809a"><span class="section-number-3">3.1.</span> Creating a file from the Terminal</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Let&rsquo;s list our working directory.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #33CCAA;">ls</span>
</pre>
</div>

<pre class="example" id="org4dc434a">
LICENSE
challenge
index.html
lesson-1.html
lesson-1.md
lesson-1.org
lesson-2.html
lesson-2.md
lesson-2.org
publish.inc
readme.html
readme.md
readme.org
resources
</pre>

<p>
We can create a new Python file in the resources directory.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #33CCAA;">touch</span> resources/hello_world.py
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e23548" class="outline-3">
<h3 id="org9e23548"><span class="section-number-3">3.2.</span> Editing a file</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Start working in the current directory.
</p>
<div class="org-src-container">
<pre class="src src-shell">code .
</pre>
</div>

<p>
We can use <code>Shift+P</code> in VS Code to open a file. Then find out <code>hello_world.py</code> file and input some Python code.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Hello Wold!"</span>)
</pre>
</div>

<p>
In VSCode we can use <code>Shift-Cmd-P</code> and search for the <code>Python: Select Interpreter</code> command to make sure we are working with the Python version we want to work with.
</p>
</div>
</div>

<div id="outline-container-org20ff3e0" class="outline-3">
<h3 id="org20ff3e0"><span class="section-number-3">3.3.</span> Running a file</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-shell">python resources/hello_world.py
</pre>
</div>

<pre class="example" id="orgc0b898a">
Hello World!
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d1f80b" class="outline-2">
<h2 id="org4d1f80b"><span class="section-number-2">4.</span> Python Types</h2>
<div class="outline-text-2" id="text-4">
<p>
Determining the type of a variable or constant.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #CC88CC;">print</span>(<span style="color: #CC88CC;">type</span>(<span style="color: #BBCCAA; font-weight: bold;">2019</span>))
<span style="color: #CC88CC;">print</span>(<span style="color: #CC88CC;">type</span>(<span style="color: #BBCCAA; font-weight: bold;">73.81</span>))
<span style="color: #CC88CC;">print</span>(<span style="color: #CC88CC;">type</span>(<span style="color: #c5937c;">"hello"</span>))
<span style="color: #CC88CC;">print</span>(<span style="color: #CC88CC;">type</span>(<span style="color: #c5937c;">""</span>))
<span style="color: #CC88CC;">print</span>(<span style="color: #CC88CC;">type</span>(<span style="color: #3399DD;">None</span>))
<span style="color: #CC88CC;">print</span>(<span style="color: #CC88CC;">type</span>(<span style="color: #3399DD;">False</span>))
</pre>
</div>

<pre class="example">
&lt;class 'int'&gt;
&lt;class 'float'&gt;
&lt;class 'str'&gt;
&lt;class 'str'&gt;
&lt;class 'NoneType'&gt;
&lt;class 'bool'&gt;
</pre>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Data Type</th>
<th scope="col" class="org-left">Python Classification</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Integers</td>
<td class="org-left">&lt;class &rsquo;int&rsquo;&gt;</td>
</tr>

<tr>
<td class="org-left">Float point numbers</td>
<td class="org-left">&lt;class &rsquo;float&rsquo;&gt;</td>
</tr>

<tr>
<td class="org-left">Strings</td>
<td class="org-left">&lt;class &rsquo;str&rsquo;&gt;</td>
</tr>

<tr>
<td class="org-left">Boolean</td>
<td class="org-left">&lt;class &rsquo;bool&rsquo;&gt;</td>
</tr>
</tbody>
</table>
</div>
