readme.org
** Creating a variable

#+begin_src python
num_candidates = 3
winning_percentage = 73.81
candidate = "Diane"
won_election = True
#+end_src

There are a few naming conventions in Python, for example using snake case for variables [fn:1] or general style guides like PEP 8 [fn:2].

** Keywords

#+begin_src python :results value org output replace
help("keywords")
#+end_src

#+RESULTS:
#+begin_src org

Here is a list of the Python keywords.  Enter any keyword to get more help.

False               class               from                or
None                continue            global              pass
True                def                 if                  raise
and                 del                 import              return
as                  elif                in                  try
assert              else                is                  while
async               except              lambda              with
await               finally             nonlocal            yield
break               for                 not

#+end_src

** Python Operations
| Operator | Meaning                                                                                                                                  | Use                      |
|----------+------------------------------------------------------------------------------------------------------------------------------------------+--------------------------|
| +        | Adds two numbers.                                                                                                                        | x + y                    |
| –        | Subtracts one number from another.                                                                                                       | x – y                    |
| *        | Multiplies two numbers.                                                                                                                  | x * y                    |
| /        | Divides one number by another. This always results in a floating-point decimal number.                                                   | x / y                    |
| %        | The “%” is known as the modulus When used in place of “/” it will divide one number by another and return the remainder of the division. | x % y (remainder of x/y) |
| //       | Divides one number by another and returns an integer. This is known as floor division.                                                   | x // y                   |
| **       | Raises a number to a power.                                                                                                              | x**y (x to the power y)  |

Order of operations must follow the order of precedence of mathematics.

#+begin_src python
print(5 + 2 * 3)
print(8 // 5 - 3)
print(8 + 22 * 2 - 4)
print(16 - 3 / 2 + 7 - 1)
print(3 ** 3 % 5)
print(5 + 9 * 3 / 2 - 4)
#+end_src

#+RESULTS:
: 11
: -2
: 48
: 20.5
: 2
: 14.5

#+begin_src python
print((5 + 2) * 3)
print((8 //5) - 3)
print((8 + (22 * (2 - 4))))
print(16 - 3 / (2 + 7) - 1)
print(3 ** (3 % 5))
#+end_src

#+RESULTS:
: 21
: -2
: -36
: 14.666666666666666
: 27

#+begin_src python
print(5 + (9 * 3 / 2 - 4))
print(5 + (9 * 3 / (2 - 4)))
#+end_src

#+RESULTS:
: 14.5
: -8.5


