readme.html

<div id="outline-container-org069aabf" class="outline-3">
<h3 id="org069aabf"><span class="section-number-3">4.1.</span> Creating a variable</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">num_candidates</span> = <span style="color: #BBCCAA; font-weight: bold;">3</span>
<span style="color: #a9dbfa;">winning_percentage</span> = <span style="color: #BBCCAA; font-weight: bold;">73.81</span>
<span style="color: #a9dbfa;">candidate</span> = <span style="color: #c5937c;">"Diane"</span>
<span style="color: #a9dbfa;">won_election</span> = <span style="color: #3399DD;">True</span>
</pre>
</div>

<p>
There are a few naming conventions in Python, for example using snake case for variables <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> or general style guides like PEP 8 <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
</div>
</div>

<div id="outline-container-orge4b429c" class="outline-3">
<h3 id="orge4b429c"><span class="section-number-3">4.2.</span> Keywords</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #CC88CC;">help</span>(<span style="color: #c5937c;">"keywords"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">
Here is a list of the Python keywords.  Enter any keyword to get more help.

False               class               from                or
None                continue            global              pass
True                def                 if                  raise
and                 del                 import              return
as                  elif                in                  try
assert              else                is                  while
async               except              lambda              with
await               finally             nonlocal            yield
break               for                 not                 

</pre>
</div>
</div>
</div>

<div id="outline-container-org275ff39" class="outline-3">
<h3 id="org275ff39"><span class="section-number-3">4.3.</span> Python Operations</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Meaning</th>
<th scope="col" class="org-left">Use</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">Adds two numbers.</td>
<td class="org-left">x + y</td>
</tr>

<tr>
<td class="org-left">–</td>
<td class="org-left">Subtracts one number from another.</td>
<td class="org-left">x – y</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">Multiplies two numbers.</td>
<td class="org-left">x * y</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">The “%” is known as the modulus When used in place of “/” it will divide one number by another and return the remainder of the division.</td>
<td class="org-left">x % y (remainder of x/y)</td>
</tr>

<tr>
<td class="org-left">//</td>
<td class="org-left">Divides one number by another and returns an integer. This is known as floor division.</td>
<td class="org-left">x // y</td>
</tr>

<tr>
<td class="org-left">**</td>
<td class="org-left">Raises a number to a power.</td>
<td class="org-left">x**y (x to the power y)</td>
</tr>
</tbody>
</table>

<p>
Order of operations must follow the order of precedence of mathematics.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">5</span> + <span style="color: #BBCCAA; font-weight: bold;">2</span> * <span style="color: #BBCCAA; font-weight: bold;">3</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">8</span> // <span style="color: #BBCCAA; font-weight: bold;">5</span> - <span style="color: #BBCCAA; font-weight: bold;">3</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">8</span> + <span style="color: #BBCCAA; font-weight: bold;">22</span> * <span style="color: #BBCCAA; font-weight: bold;">2</span> - <span style="color: #BBCCAA; font-weight: bold;">4</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">16</span> - <span style="color: #BBCCAA; font-weight: bold;">3</span> / <span style="color: #BBCCAA; font-weight: bold;">2</span> + <span style="color: #BBCCAA; font-weight: bold;">7</span> - <span style="color: #BBCCAA; font-weight: bold;">1</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">3</span> ** <span style="color: #BBCCAA; font-weight: bold;">3</span> % <span style="color: #BBCCAA; font-weight: bold;">5</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">5</span> + <span style="color: #BBCCAA; font-weight: bold;">9</span> * <span style="color: #BBCCAA; font-weight: bold;">3</span> / <span style="color: #BBCCAA; font-weight: bold;">2</span> - <span style="color: #BBCCAA; font-weight: bold;">4</span>)
</pre>
</div>

<pre class="example">
11
-2
48
20.5
2
14.5
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #CC88CC;">print</span>((<span style="color: #BBCCAA; font-weight: bold;">5</span> + <span style="color: #BBCCAA; font-weight: bold;">2</span>) * <span style="color: #BBCCAA; font-weight: bold;">3</span>)
<span style="color: #CC88CC;">print</span>((<span style="color: #BBCCAA; font-weight: bold;">8</span> //<span style="color: #BBCCAA; font-weight: bold;">5</span>) - <span style="color: #BBCCAA; font-weight: bold;">3</span>)
<span style="color: #CC88CC;">print</span>((<span style="color: #BBCCAA; font-weight: bold;">8</span> + (<span style="color: #BBCCAA; font-weight: bold;">22</span> * (<span style="color: #BBCCAA; font-weight: bold;">2</span> - <span style="color: #BBCCAA; font-weight: bold;">4</span>))))
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">16</span> - <span style="color: #BBCCAA; font-weight: bold;">3</span> / (<span style="color: #BBCCAA; font-weight: bold;">2</span> + <span style="color: #BBCCAA; font-weight: bold;">7</span>) - <span style="color: #BBCCAA; font-weight: bold;">1</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">3</span> ** (<span style="color: #BBCCAA; font-weight: bold;">3</span> % <span style="color: #BBCCAA; font-weight: bold;">5</span>))
</pre>
</div>

<pre class="example">
21
-2
-36
14.666666666666666
27
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">5</span> + (<span style="color: #BBCCAA; font-weight: bold;">9</span> * <span style="color: #BBCCAA; font-weight: bold;">3</span> / <span style="color: #BBCCAA; font-weight: bold;">2</span> - <span style="color: #BBCCAA; font-weight: bold;">4</span>))
<span style="color: #CC88CC;">print</span>(<span style="color: #BBCCAA; font-weight: bold;">5</span> + (<span style="color: #BBCCAA; font-weight: bold;">9</span> * <span style="color: #BBCCAA; font-weight: bold;">3</span> / (<span style="color: #BBCCAA; font-weight: bold;">2</span> - <span style="color: #BBCCAA; font-weight: bold;">4</span>)))
</pre>
</div>

<pre class="example">
14.5
-8.5
</pre>
</div>
</div>
</div>
