readme.org
* Python Lists

A list is an array that contains multiple data items.

#+begin_src python
counties = ["Arapahoe", "Denver", "Jefferson"]
print("This is the list:", counties)
print("This is the first item:", counties[0])
print("This is the last item:", counties[-1])
print("This is the length of the list:", len(counties))
print("This is a slice of the list:", counties[0:2])
print("This is other way to slice:", counties[:2])
#+end_src

#+RESULTS:
: This is the list: ['Arapahoe', 'Denver', 'Jefferson']
: This is the first item: Arapahoe
: This is the last item: Jefferson
: This is the length of the list: 3
: This is a slice of the list: ['Arapahoe', 'Denver']
: This is other way to slice: ['Arapahoe', 'Denver']

Appending items to a list.
#+begin_src python
counties = ["Arapahoe", "Denver", "Jefferson"]
counties.append("El Paso")
counties.insert(2, "El Paso")
print("We added El Paso twice to the list.")
print(counties)
counties.remove("El Paso")
print("We removed the first instance of El Paso.")
print(counties)
counties.pop(-1)
print("We removed the last element in the list.")
print(counties)
#+end_src

#+RESULTS:
: We added El Paso twice to the list.
: ['Arapahoe', 'Denver', 'El Paso', 'Jefferson', 'El Paso']
: We removed the first instance of El Paso.
: ['Arapahoe', 'Denver', 'Jefferson', 'El Paso']
: We removed the last element in the list.
: ['Arapahoe', 'Denver', 'Jefferson']

Changing elements from a list.
#+begin_src python
counties = ["Arapahoe", "Denver", "Jefferson"]
counties[2] = "El Paso"
print("We replace index at 2 with El Paso.")
print(counties)
#+end_src

#+RESULTS:
: We replace index at 2 with El Paso.
: ['Arapahoe', 'Denver', 'El Paso']

Let's try it all together.
#+begin_src python
counties = ["Arapahoe", "Denver", "Jefferson"]
counties.insert(1, "El Paso")
counties.remove("Arapahoe")
jefferson = counties[2]
counties[2] = counties[1]
counties[1] = jefferson
counties.append("Arapahoe")
print(counties)
#+end_src

#+RESULTS:
: ['El Paso', 'Jefferson', 'Denver', 'Arapahoe']

* Python Tuples

Tuples are immutable data structures that contain one or more items.
#+begin_src python
counties = ("Arapahoe", "Denver", "Jefferson")
print(counties[:-1])
#+end_src

#+RESULTS:
: ('Arapahoe', 'Denver')

* Python Dictionaries

A dictionary is an object that stores a collection of data. It has a key and a value (key-value pairs).

#+begin_src python
counties = {}
counties["Arapahoe"] = 422829
print(counties)
counties["Denver"] = 463353
counties["Jefferson"] = 432438
print(counties)
print(counties.keys())
print(counties.values())
print(counties.get("Denver"))
#+end_src

#+RESULTS:
: {'Arapahoe': 422829}
: {'Arapahoe': 422829, 'Denver': 463353, 'Jefferson': 432438}
: dict_keys(['Arapahoe', 'Denver', 'Jefferson'])
: dict_values([422829, 463353, 432438])
: 463353

List of dictionaries.
#+begin_src python
voting_data = []
voting_data.append({"county":"Arapahoe", "registered_voters":422829})
voting_data.append({"county":"Denver", "registered_voters":463353})
voting_data.append({"county":"Jefferson", "registered_voters":432438})
print(voting_data)
#+end_src

#+RESULTS:
: [{'county': 'Arapahoe', 'registered_voters': 422829}, {'county': 'Denver', 'registered_voters': 463353}, {'county': 'Jefferson', 'registered_voters': 432438}]

The previous dictionary is the equivalent of this table.

| county    | registered_voters |
|-----------+-------------------|
| Arapahoe  |            422829 |
| Denver    |            463353 |
| Jefferson |            432438 |

#+begin_src python
voting_data = [{'county': 'Arapahoe', 'registered_voters': 422829}, {'county': 'Denver', 'registered_voters': 463353}, {'county': 'Jefferson', 'registered_voters': 432438}]

voting_data.insert(1, {"county":"El Paso", "registered_voters":461149})
arapahoe = voting_data.pop(0)
denver = voting_data[1]
jefferson = voting_data[2]
voting_data[2] = denver
voting_data[1] = jefferson
voting_data.append(arapahoe)
print(voting_data)
#+end_src

#+RESULTS:
: [{'county': 'El Paso', 'registered_voters': 461149}, {'county': 'Jefferson', 'registered_voters': 432438}, {'county': 'Denver', 'registered_voters': 463353}, {'county': 'Arapahoe', 'registered_voters': 422829}]

For more info on dictionaries and built-in Python functions, we can go to the documentation [fn:3].

