readme.html


<div id="outline-container-orgf4586a1" class="outline-2">
<h2 id="orgf4586a1"><span class="section-number-2">5.</span> Python Lists</h2>
<div class="outline-text-2" id="text-5">
<p>
A list is an array that contains multiple data items.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = [<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>]
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"This is the list:"</span>, counties)
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"This is the first item:"</span>, counties[<span style="color: #BBCCAA; font-weight: bold;">0</span>])
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"This is the last item:"</span>, counties[-<span style="color: #BBCCAA; font-weight: bold;">1</span>])
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"This is the length of the list:"</span>, <span style="color: #CC88CC;">len</span>(counties))
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"This is a slice of the list:"</span>, counties[<span style="color: #BBCCAA; font-weight: bold;">0</span>:<span style="color: #BBCCAA; font-weight: bold;">2</span>])
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"This is other way to slice:"</span>, counties[:<span style="color: #BBCCAA; font-weight: bold;">2</span>])
</pre>
</div>

<pre class="example">
This is the list: ['Arapahoe', 'Denver', 'Jefferson']
This is the first item: Arapahoe
This is the last item: Jefferson
This is the length of the list: 3
This is a slice of the list: ['Arapahoe', 'Denver']
This is other way to slice: ['Arapahoe', 'Denver']
</pre>


<p>
Appending items to a list.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = [<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>]
counties.append(<span style="color: #c5937c;">"El Paso"</span>)
counties.insert(<span style="color: #BBCCAA; font-weight: bold;">2</span>, <span style="color: #c5937c;">"El Paso"</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We added El Paso twice to the list."</span>)
<span style="color: #CC88CC;">print</span>(counties)
counties.remove(<span style="color: #c5937c;">"El Paso"</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We removed the first instance of El Paso."</span>)
<span style="color: #CC88CC;">print</span>(counties)
counties.pop(-<span style="color: #BBCCAA; font-weight: bold;">1</span>)
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We removed the last element in the list."</span>)
<span style="color: #CC88CC;">print</span>(counties)
</pre>
</div>

<pre class="example">
We added El Paso twice to the list.
['Arapahoe', 'Denver', 'El Paso', 'Jefferson', 'El Paso']
We removed the first instance of El Paso.
['Arapahoe', 'Denver', 'Jefferson', 'El Paso']
We removed the last element in the list.
['Arapahoe', 'Denver', 'Jefferson']
</pre>


<p>
Changing elements from a list.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = [<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>]
<span style="color: #a9dbfa;">counties</span>[<span style="color: #BBCCAA; font-weight: bold;">2</span>] = <span style="color: #c5937c;">"El Paso"</span>
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"We replace index at 2 with El Paso."</span>)
<span style="color: #CC88CC;">print</span>(counties)
</pre>
</div>

<pre class="example">
We replace index at 2 with El Paso.
['Arapahoe', 'Denver', 'El Paso']
</pre>


<p>
Let&rsquo;s try it all together.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = [<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>]
counties.insert(<span style="color: #BBCCAA; font-weight: bold;">1</span>, <span style="color: #c5937c;">"El Paso"</span>)
counties.remove(<span style="color: #c5937c;">"Arapahoe"</span>)
<span style="color: #a9dbfa;">jefferson</span> = counties[<span style="color: #BBCCAA; font-weight: bold;">2</span>]
<span style="color: #a9dbfa;">counties</span>[<span style="color: #BBCCAA; font-weight: bold;">2</span>] = counties[<span style="color: #BBCCAA; font-weight: bold;">1</span>]
<span style="color: #a9dbfa;">counties</span>[<span style="color: #BBCCAA; font-weight: bold;">1</span>] = jefferson
counties.append(<span style="color: #c5937c;">"Arapahoe"</span>)
<span style="color: #CC88CC;">print</span>(counties)
</pre>
</div>

<pre class="example">
['El Paso', 'Jefferson', 'Denver', 'Arapahoe']
</pre>
</div>
</div>

<div id="outline-container-orgcbe33a7" class="outline-2">
<h2 id="orgcbe33a7"><span class="section-number-2">6.</span> Python Tuples</h2>
<div class="outline-text-2" id="text-6">
<p>
Tuples are immutable data structures that contain one or more items.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = (<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>)
<span style="color: #CC88CC;">print</span>(counties[:-<span style="color: #BBCCAA; font-weight: bold;">1</span>])
</pre>
</div>

<pre class="example">
('Arapahoe', 'Denver')
</pre>
</div>
</div>

<div id="outline-container-orgce49552" class="outline-2">
<h2 id="orgce49552"><span class="section-number-2">7.</span> Python Dictionaries</h2>
<div class="outline-text-2" id="text-7">
<p>
A dictionary is an object that stores a collection of data. It has a key and a value (key-value pairs).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = {}
<span style="color: #a9dbfa;">counties</span>[<span style="color: #c5937c;">"Arapahoe"</span>] = <span style="color: #BBCCAA; font-weight: bold;">422829</span>
<span style="color: #CC88CC;">print</span>(counties)
<span style="color: #a9dbfa;">counties</span>[<span style="color: #c5937c;">"Denver"</span>] = <span style="color: #BBCCAA; font-weight: bold;">463353</span>
<span style="color: #a9dbfa;">counties</span>[<span style="color: #c5937c;">"Jefferson"</span>] = <span style="color: #BBCCAA; font-weight: bold;">432438</span>
<span style="color: #CC88CC;">print</span>(counties)
<span style="color: #CC88CC;">print</span>(counties.keys())
<span style="color: #CC88CC;">print</span>(counties.values())
<span style="color: #CC88CC;">print</span>(counties.get(<span style="color: #c5937c;">"Denver"</span>))
</pre>
</div>

<pre class="example">
{'Arapahoe': 422829}
{'Arapahoe': 422829, 'Denver': 463353, 'Jefferson': 432438}
dict_keys(['Arapahoe', 'Denver', 'Jefferson'])
dict_values([422829, 463353, 432438])
463353
</pre>


<p>
List of dictionaries.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">voting_data</span> = []
voting_data.append({<span style="color: #c5937c;">"county"</span>:<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"registered_voters"</span>:<span style="color: #BBCCAA; font-weight: bold;">422829</span>})
voting_data.append({<span style="color: #c5937c;">"county"</span>:<span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"registered_voters"</span>:<span style="color: #BBCCAA; font-weight: bold;">463353</span>})
voting_data.append({<span style="color: #c5937c;">"county"</span>:<span style="color: #c5937c;">"Jefferson"</span>, <span style="color: #c5937c;">"registered_voters"</span>:<span style="color: #BBCCAA; font-weight: bold;">432438</span>})
<span style="color: #CC88CC;">print</span>(voting_data)
</pre>
</div>

<pre class="example">
[{'county': 'Arapahoe', 'registered_voters': 422829}, {'county': 'Denver', 'registered_voters': 463353}, {'county': 'Jefferson', 'registered_voters': 432438}]
</pre>


<p>
The previous dictionary is the equivalent of this table.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">county</th>
<th scope="col" class="org-right">registered<sub>voters</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Arapahoe</td>
<td class="org-right">422829</td>
</tr>

<tr>
<td class="org-left">Denver</td>
<td class="org-right">463353</td>
</tr>

<tr>
<td class="org-left">Jefferson</td>
<td class="org-right">432438</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">voting_data</span> = [{<span style="color: #c5937c;">'county'</span>: <span style="color: #c5937c;">'Arapahoe'</span>, <span style="color: #c5937c;">'registered_voters'</span>: <span style="color: #BBCCAA; font-weight: bold;">422829</span>}, {<span style="color: #c5937c;">'county'</span>: <span style="color: #c5937c;">'Denver'</span>, <span style="color: #c5937c;">'registered_voters'</span>: <span style="color: #BBCCAA; font-weight: bold;">463353</span>}, {<span style="color: #c5937c;">'county'</span>: <span style="color: #c5937c;">'Jefferson'</span>, <span style="color: #c5937c;">'registered_voters'</span>: <span style="color: #BBCCAA; font-weight: bold;">432438</span>}]

voting_data.insert(<span style="color: #BBCCAA; font-weight: bold;">1</span>, {<span style="color: #c5937c;">"county"</span>:<span style="color: #c5937c;">"El Paso"</span>, <span style="color: #c5937c;">"registered_voters"</span>:<span style="color: #BBCCAA; font-weight: bold;">461149</span>})
<span style="color: #a9dbfa;">arapahoe</span> = voting_data.pop(<span style="color: #BBCCAA; font-weight: bold;">0</span>)
<span style="color: #a9dbfa;">denver</span> = voting_data[<span style="color: #BBCCAA; font-weight: bold;">1</span>]
<span style="color: #a9dbfa;">jefferson</span> = voting_data[<span style="color: #BBCCAA; font-weight: bold;">2</span>]
<span style="color: #a9dbfa;">voting_data</span>[<span style="color: #BBCCAA; font-weight: bold;">2</span>] = denver
<span style="color: #a9dbfa;">voting_data</span>[<span style="color: #BBCCAA; font-weight: bold;">1</span>] = jefferson
voting_data.append(arapahoe)
<span style="color: #CC88CC;">print</span>(voting_data)
</pre>
</div>

<pre class="example">
[{'county': 'El Paso', 'registered_voters': 461149}, {'county': 'Jefferson', 'registered_voters': 432438}, {'county': 'Denver', 'registered_voters': 463353}, {'county': 'Arapahoe', 'registered_voters': 422829}]
</pre>


<p>
For more info on dictionaries and built-in Python functions, we can go to the documentation <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>
</div>
</div>
