readme.html

<div id="outline-container-org4f79676" class="outline-2">
<h2 id="org4f79676"><span class="section-number-2">8.</span> Decision Statements</h2>
<div class="outline-text-2" id="text-8">
<p>
If statements represent different paths in a flow chart. Where if the statement is true, false or equal, we proceed with the following block of code.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = [<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>]
<span style="color: #3399DD;">if</span> counties[<span style="color: #BBCCAA; font-weight: bold;">1</span>] == <span style="color: #c5937c;">"Denver"</span>:
    <span style="color: #CC88CC;">print</span>(counties[<span style="color: #BBCCAA; font-weight: bold;">1</span>])
</pre>
</div>

<pre class="example">
Denver
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">temperature</span> = <span style="color: #BBCCAA; font-weight: bold;">79</span>
<span style="color: #3399DD;">if</span> temperature &gt; <span style="color: #BBCCAA; font-weight: bold;">80</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Hot"</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Not so hot."</span>)
</pre>
</div>

<pre class="example">
Not so hot.
</pre>
</div>

<div id="outline-container-org18b718c" class="outline-3">
<h3 id="org18b718c"><span class="section-number-3">8.1.</span> Nested if statements</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">score</span> = <span style="color: #BBCCAA; font-weight: bold;">85</span>
<span style="color: #3399DD;">if</span> score &gt;= <span style="color: #BBCCAA; font-weight: bold;">90</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Your grade is A"</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #3399DD;">if</span> score &gt;= <span style="color: #BBCCAA; font-weight: bold;">80</span>:
        <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Your grade is B"</span>)
    <span style="color: #3399DD;">else</span>:
        ...
</pre>
</div>

<pre class="example">
Your grade is B
</pre>
</div>
</div>

<div id="outline-container-orgb168873" class="outline-3">
<h3 id="orgb168873"><span class="section-number-3">8.2.</span> Elif</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">score</span> = <span style="color: #BBCCAA; font-weight: bold;">90</span>
<span style="color: #3399DD;">if</span> score &gt;= <span style="color: #BBCCAA; font-weight: bold;">90</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Grade is A"</span>)
<span style="color: #3399DD;">elif</span> score &gt;= <span style="color: #BBCCAA; font-weight: bold;">80</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Grade is B"</span>)
<span style="color: #3399DD;">elif</span> score &gt;= <span style="color: #BBCCAA; font-weight: bold;">70</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Grade is C"</span>)
<span style="color: #3399DD;">else</span>:
    ...
</pre>
</div>

<pre class="example">
Grade is A
</pre>
</div>
</div>

<div id="outline-container-orgf4503f3" class="outline-3">
<h3 id="orgf4503f3"><span class="section-number-3">8.3.</span> Logical Operators</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties</span> = [<span style="color: #c5937c;">"Arapahoe"</span>, <span style="color: #c5937c;">"Denver"</span>, <span style="color: #c5937c;">"Jefferson"</span>]
<span style="color: #3399DD;">if</span> <span style="color: #c5937c;">"El Paso"</span> <span style="color: #3399DD;">in</span> counties:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"El Paso is in the list."</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"El Paso is not in the list."</span>)

<span style="color: #3399DD;">if</span> <span style="color: #c5937c;">"Arapahoe"</span> <span style="color: #3399DD;">in</span> counties <span style="color: #3399DD;">and</span> <span style="color: #c5937c;">"El Paso"</span> <span style="color: #3399DD;">in</span> counties:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Both in list."</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Either one is not in the list."</span>)

<span style="color: #3399DD;">if</span> <span style="color: #c5937c;">"Arapahoe"</span> <span style="color: #3399DD;">in</span> counties <span style="color: #3399DD;">or</span> <span style="color: #c5937c;">"El Paso"</span> <span style="color: #3399DD;">in</span> counties:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"One of them in the list."</span>)
<span style="color: #3399DD;">else</span>:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"None of them in the list."</span>)

 <span style="color: #3399DD;">if</span> <span style="color: #c5937c;">"Arapahoe"</span> <span style="color: #3399DD;">in</span> counties <span style="color: #3399DD;">and</span> <span style="color: #c5937c;">"El Paso"</span> <span style="color: #3399DD;">not</span> <span style="color: #3399DD;">in</span> counties:
    <span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Arpahoe is but El Paso isn't."</span>)
<span style="color: #3399DD;">else</span>:
    ...

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9181007" class="outline-2">
<h2 id="org9181007"><span class="section-number-2">9.</span> Loops</h2>
<div class="outline-text-2" id="text-9">
<p>
A single instruction that is repeated multiple times.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">x</span> = <span style="color: #BBCCAA; font-weight: bold;">0</span>
<span style="color: #3399DD;">while</span> x &lt;= <span style="color: #BBCCAA; font-weight: bold;">3</span>:
    <span style="color: #CC88CC;">print</span>(x)
    <span style="color: #a9dbfa;">x</span> += <span style="color: #BBCCAA; font-weight: bold;">1</span>
</pre>
</div>

<pre class="example">
0
1
2
3
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">numbers</span> = [<span style="color: #BBCCAA; font-weight: bold;">0</span>, <span style="color: #BBCCAA; font-weight: bold;">1</span>, <span style="color: #BBCCAA; font-weight: bold;">2</span>, <span style="color: #BBCCAA; font-weight: bold;">3</span>]
<span style="color: #3399DD;">for</span> number <span style="color: #3399DD;">in</span> <span style="color: #a9dbfa;">numbers</span>:
    <span style="color: #CC88CC;">print</span>(number)

<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Now with a range."</span>)
<span style="color: #3399DD;">for</span> n <span style="color: #3399DD;">in</span> <span style="color: #CC88CC;">range</span>(<span style="color: #BBCCAA; font-weight: bold;">4</span>):
    <span style="color: #CC88CC;">print</span>(n)

num_dict = {<span style="color: #c5937c;">"a"</span>:<span style="color: #BBCCAA; font-weight: bold;">0</span>, <span style="color: #c5937c;">"b"</span>:<span style="color: #BBCCAA; font-weight: bold;">1</span>, <span style="color: #c5937c;">"c"</span>:<span style="color: #BBCCAA; font-weight: bold;">2</span>, <span style="color: #c5937c;">"d"</span>:<span style="color: #BBCCAA; font-weight: bold;">3</span>}
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Now over dict keys."</span>)
<span style="color: #3399DD;">for</span> k <span style="color: #3399DD;">in</span> num_dict:
    <span style="color: #CC88CC;">print</span>(k, num_dict[k])
</pre>
</div>

<pre class="example" id="orga815049">
0
1
2
3
Now with a range.
0
1
2
3
Now over dict keys.
a 0
b 1
c 2
d 3
</pre>
</div>

<div id="outline-container-org1fe2379" class="outline-3">
<h3 id="org1fe2379"><span class="section-number-3">9.1.</span> Iterating over Dictionaries</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">data</span> = [{<span style="color: #c5937c;">'county'</span>: <span style="color: #c5937c;">'Arapahoe'</span>, <span style="color: #c5937c;">'registered_voters'</span>: <span style="color: #BBCCAA; font-weight: bold;">422829</span>}, {<span style="color: #c5937c;">'county'</span>: <span style="color: #c5937c;">'Denver'</span>, <span style="color: #c5937c;">'registered_voters'</span>: <span style="color: #BBCCAA; font-weight: bold;">463353</span>}, {<span style="color: #c5937c;">'county'</span>: <span style="color: #c5937c;">'Jefferson'</span>, <span style="color: #c5937c;">'registered_voters'</span>: <span style="color: #BBCCAA; font-weight: bold;">432438</span>}]
<span style="color: #3399DD;">for</span> i <span style="color: #3399DD;">in</span> <span style="color: #CC88CC;">range</span>(<span style="color: #CC88CC;">len</span>(data)):
    <span style="color: #CC88CC;">print</span>(data[i][<span style="color: #c5937c;">"county"</span>])
    <span style="color: #CC88CC;">print</span>(data[i][<span style="color: #c5937c;">"registered_voters"</span>])
</pre>
</div>

<pre class="example">
Arapahoe
422829
Denver
463353
Jefferson
432438
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bd0439" class="outline-2">
<h2 id="org4bd0439"><span class="section-number-2">10.</span> F-Strings and Printing</h2>
<div class="outline-text-2" id="text-10">
<p>
Printing with f-strings
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">counties_dict</span> = {<span style="color: #c5937c;">"Arapahoe"</span>: <span style="color: #BBCCAA; font-weight: bold;">369237</span>, <span style="color: #c5937c;">"Denver"</span>:<span style="color: #BBCCAA; font-weight: bold;">413229</span>, <span style="color: #c5937c;">"Jefferson"</span>: <span style="color: #BBCCAA; font-weight: bold;">390222</span>}
<span style="color: #3399DD;">for</span> county, voters <span style="color: #3399DD;">in</span> counties_dict.items():
    <span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"</span>{county}<span style="color: #c5937c;"> county has </span>{voters}<span style="color: #c5937c;"> registered voters"</span>)
</pre>
</div>

<pre class="example">
Arapahoe county has 369237 registered voters
Denver county has 413229 registered voters
Jefferson county has 390222 registered voters
</pre>


<p>
Point decimals formatting.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">candidate_votes</span> = <span style="color: #BBCCAA; font-weight: bold;">313123</span>
<span style="color: #a9dbfa;">total_votes</span> = <span style="color: #BBCCAA; font-weight: bold;">1203920</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"You received </span>{candidate_votes / total_votes * 100:.2f}<span style="color: #c5937c;">% of the total votes."</span>)
</pre>
</div>

<pre class="example">
You received 26.01% of the total votes.
</pre>
</div>
</div>
